imported/solids4foam/tutorials/fluidSolidInteraction/beamInCrossFlow/overset/constant/fluid/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dynamicFvMesh newSubsetMotionSolverFvMesh; //dynamicMotionSolverFvMesh;

solver velocityLaplacian;
diffusivity quadratic inverseDistance (interface);

newSubsetMotionSolverFvMeshCoeffs
{
    set front;

    alpha 1;
}

// ************************************************************************* //
